bench/results/java11/20260309T210615Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "duration_s": 120, "warmup_s": 60, "concurrency": 25, "threads": 4, "requests_per_sec": 7089.73, "p50": "3.19ms", "p95": "6.10ms", "p99": "7.23ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 2m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     3.39ms    1.23ms  28.23ms   72.24%\n    Req/Sec     1.78k   163.91     2.09k    77.04%\n  Latency Distribution\n     50%    3.19ms\n     75%    4.03ms\n     90%    4.97ms\n     99%    7.23ms\n  850966 requests in 2.00m, 193.96MB read\nRequests/sec:   7089.73\nTransfer/sec:      1.62MB"}